tutorials/multiphase/vof/vofSolver/ras/floatingObject/0.org/p_rgh
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    stationaryWalls
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    atmosphere
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           uniform 0;
    }
    floatingObject
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
}


// ************************************************************************* //
