tutorials/multiphase/vof/vofSolver/ras/floatingObject/system/setFieldsDict
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha1 0
);

regions
(
    boxToCell
    {
        box (-100 -100 -100) (100 100 0.5368);
        fieldValues ( volScalarFieldValue alpha1 1 );
    }

    boxToCell
    {
        box (0.7 0.8 -100) (100 100 0.65);
        fieldValues ( volScalarFieldValue alpha1 1 );
    }
);


// ************************************************************************* //
